main-site/blog/introduction-to-git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-11 Tue 20:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Git</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Henry Senior" />
<link rel="stylesheet" type="text/css" href="http://henrysenior.com/css/main.css" /></head>
<body>
<div id="content">
<h1 class="title">Introduction to Git</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3eab47d">1. What is Git?</a></li>
<li><a href="#orgb4bd44c">2. What is GitHub?</a></li>
<li><a href="#orgcb7d798">3. What you'll need</a></li>
<li><a href="#orge529546">4. Setting Up Your Git Terminal</a></li>
<li><a href="#org62305a0">5. Creating Repositories on GitHub</a>
<ul>
<li><a href="#orgaa175d5">5.1. Making a New Repository</a></li>
</ul>
</li>
<li><a href="#orgaf2e694">6. Basic Git Commands</a>
<ul>
<li><a href="#org1a3b2f7">6.1. Clone</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3eab47d" class="outline-2">
<h2 id="org3eab47d"><span class="section-number-2">1</span> What is Git?</h2>
<div class="outline-text-2" id="text-1">
<p>
Git is a version control system developed by Linus Torvalds to help manage the Linux source code. There were lots of developers adding features, removing bugs, and doing other things to Linux and it was hard to keep track of all the changes. It was also difficult to see how changes were effecting the code as a whole, making it much harder to roll back to an older version if a bug was discovered. The aim of git was to create a version control system that would allow lots of developers to work on their own section of the code whilst maintaining a version that was bug free and ready to ship.
</p>
</div>
</div>

<div id="outline-container-orgb4bd44c" class="outline-2">
<h2 id="orgb4bd44c"><span class="section-number-2">2</span> What is GitHub?</h2>
<div class="outline-text-2" id="text-2">
<p>
GitHub is a service built on top of Git that allows developers to collaborate all over the world to solve problems. It’s probably best summed up by this <a href="https://www.google.com">short video</a>.
</p>
</div>
</div>

<div id="outline-container-orgcb7d798" class="outline-2">
<h2 id="orgcb7d798"><span class="section-number-2">3</span> What you'll need</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://github.com">A GitHub account</a> (GitLab or BitBucket should work equally well but this tutorial is focussed on GitHub)</li>
<li><a href="https://git-scm.com/downloads">A git terminal</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge529546" class="outline-2">
<h2 id="orge529546"><span class="section-number-2">4</span> Setting Up Your Git Terminal</h2>
<div class="outline-text-2" id="text-4">
<p>
First things first, we need to tell git our name and email. This will allow developers to contact one another to ask about code changes if git is being used outside a service like GitHub.
</p>

<div class="org-src-container">
<pre class="src src-bash">$ git config --global user.name <span style="color: #2aa198;">"your name here"</span>
$ git config --global user.email <span style="color: #2aa198;">"your email here"</span>
</pre>
</div>

<p>
Git bash utilises the bash commands popular on macOS and Linux. Here are some of the basics:
</p>
<div class="org-src-container">
<pre class="src src-bash">$ ls <span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">list the files in a directory</span>
$ ls -a <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">list ALL the files in a directory</span>
$ pwd <span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">prints the working directory (you're current directory)</span>
$ touch file-name.txt <span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">creates a file called file name.txt</span>
$ mkdir directory-name <span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">creates a directory called directory-name</span>
$ cd directory-name <span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">changes current directory to directory-name</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org62305a0" class="outline-2">
<h2 id="org62305a0"><span class="section-number-2">5</span> Creating Repositories on GitHub</h2>
<div class="outline-text-2" id="text-5">
<p>
A repository, or repo for short, is the place where your code lives. I should emphasis that it is where the code lives, not where other things that go along with a programming project live. Files such as compiler outputs (.class files in Java for example) should be generated by each developer, not stored on a git server. <a href="https://github.com/github/gitignore/">These kinds of files are excluded automatically by .gitignore files</a>.
</p>
</div>

<div id="outline-container-orgaa175d5" class="outline-3">
<h3 id="orgaa175d5"><span class="section-number-3">5.1</span> Making a New Repository</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Go to <a href="https://www.github.com">github.com</a></li>
<li>In the top right corner, press the + button</li>
<li>Select “New Repository”</li>
<li>Give it a name (replace spaces with ‘-’)</li>
<li>Give it a description</li>
<li>Decide whether it will be public or private</li>
<li>Initilise the repo with a README.md file</li>
<li>Add a .gitignore file for the language or IDE you’re using</li>
<li>Add a license (Any of the first three do the job perfectly)</li>
</ol>

<p>
You will now have a pretty empty repository on GitHub
</p>
</div>
</div>
</div>

<div id="outline-container-orgaf2e694" class="outline-2">
<h2 id="orgaf2e694"><span class="section-number-2">6</span> Basic Git Commands</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org1a3b2f7" class="outline-3">
<h3 id="org1a3b2f7"><span class="section-number-3">6.1</span> Clone</h3>
<div class="outline-text-3" id="text-6-1">
<p>
The git clone command will download a repository into a new folder in your current working directory. When on a project’s page there will be a drop down button to get the URL required to clone that specific project. You can use the clone command to download the repository you just made in the previous step. Go to the repository's GitHub page (Github.com/&lt;your-username&gt;/&lt;repository-name&gt;) and press the green "Code" button. This will let you copy a link to the <code>.git</code> file.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
